---
kind: method
id: M:Autodesk.Revit.DB.Categories.GetEnumerator
source: html/e3fae454-0b81-94dc-b5e2-5209d73fa6d2.htm
---
# Autodesk.Revit.DB.Categories.GetEnumerator Method

Retrieves a forward moving iterator to the map.

## Syntax (C#)
```csharp
public override IEnumerator GetEnumerator()
```

## Returns
A forward moving iterator to the map.